# Задача №1483.
#
# Даны значения двух моментов времени, принадлежащих одним и тем же суткам: часы, потом минуты и секунды для каждого из
# моментов времени. Известно, что второй момент времени наступил не раньше первого. Определите, сколько секунд прошло
# между двумя моментами времени.
#
# Входные данные
# В первой строке входных данных находятся три целых числа — часы, минуты и секунды первого момента времени.
# Во второй строке — три числа, характеризующие второй момент времени.
# Число часов лежит в диапазоне от 0 до 23, число минут и секунд — от 0 до 59.
#
# Выходные данные
# Выведите число секунд между двумя моментами времени.
#
# Примеры
# Входные данные
# 1 1 1
# 2 2 2
# Выходные данные
# 3661
# Входные данные
# 1 2 30
# 1 3 20
# Выходные данные
# 50
