# Задача №110. Поиск подстроки
#
# Даны две строки. Определите, является ли первая строка подстрокой второй строки.

# Код должен содержать 2 решения:
# - используя оператор in
# - свое решение. Можно идти по каждому символу строки и делать в ней срез длины, которая равна длине подстроки.
# И если срез совпадает с подстрокой, то ответ yes.

# Входные данные
# На вход подается 2 строки, состоящие только из маленьких букв латинского алфавита.
#
# Выходные данные
# Необходимо вывести  слово yes, если первая строка является подстрокой второй строки, или слово no в противном случае.
#
# Примеры
# входные данные
# abac
# ababacaba
# выходные данные
# yes