# Задача №3117. Количество слов
#
# Дана строка, состоящая из слов, разделенных пробелами. Определите, сколько в ней слов. Используйте для решения задачи
# метод count.

# Подсказка:
# Для того чтобы определить количество слов в строке, разделённых пробелами, можно использовать метод count, который
# подсчитывает количество пробелов в строке. Затем добавляем единицу, так как количество слов на одно больше количества
# пробелов между ними.

#
# Входные данные
# Вводится строка.
#
# Выходные данные
# Выведите ответ на задачу.
#
# Примеры
# Входные данные
# Hello world
# Выходные данные
# 2
# Входные данные
# Hello world this is a test
# Выходные данные
# 6
# Входные данные
# one two three
# Выходные данные
# 3