# Задача №103. Перевести символ в верхний регистр
#
# Напишите программу, которая переводит данный символ в верхний регистр.
#
# Код должен содержать 2 решения:
# - используя встроенную функцию upper для строки
# - свое решение
#
# Входные данные
# Задан один символ c.
#
# Выходные данные
# Если символ является строчной буквой латинского алфавита (то есть буквой от a до z), выведите вместо него аналогичную
# заглавную букву, иначе выведите тот же самый символ (такая операция называется "перевод в верхний регистр").
#
# Примеры
# Входные данные
# e
# Выходные данные
# E
# Входные данные
# B
# Выходные данные
# B

value = input("Enter your value: ")
print(value.upper())

lowers = "abcdefghijklmnopqrstuvwxyz"
uppers = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"

ind = -1
for i in range(0, len(lowers)):
    if lowers[i] == value:
        ind = i
        break

if ind != -1:
    print(uppers[ind])
else:
    print(value)
