# С помощью оператора = присвоить переменной user_name значение admin.
# Распечатать результат

# С помощью оператора + сложить целые значения 10 и 20 и присвоить int_sum.
# Распечатать результат

# С помощью оператора + сложить два числа 10.1 и 19.9 и присвоить int_float.
# Распечатать результат

# С помощью оператора + сложить две строки Hello и World и присвоить int_str.
# Распечатать результат

# С помощью оператора - вычесть из числа 20 число 10 и присвоить int_subtract.
# Распечатать результат

# С помощью оператора - вычесть из числа 20.2 число 10.1 и присвоить float_subtract.
# Распечатать результат

# С помощью оператора * перемножить два 20 и 10 и присвоить int_multiply.
# Распечатать результат

# С помощью оператора / разделить два 20 и 10 и присвоить int_divide.
# Распечатать результат

# Раздели число 50 пополам, и сохрани результат в int_divide_2.
# Распечатать результат и убедиться, что выводится 25.


# С помощью оператора % посчитай остаток от деления 15 на 10 и запиши его в modulo_value.
# Распечатать результат и убедиться, что выводится 5.

# Напишите программу, которая запрашивает у пользователя целое число и выводит сообщение о том, является ли оно
# четным или нечетным.


# С помощью оператора // посчитай результат целочисленного деления 15 на 10 и запиши его в int_division.
# Распечатать результат и убедиться, что выводится 1.

# С помощью оператора // посчитай результат целочисленного деления 29 на 7 и запиши его в int_division_2.
# Распечатать результат и убедиться, что выводится 4.


# С помощью оператора == сравнить два числа и записать значение в compare_ints.
# Распечатать compare_ints и убедиться, что он выводит True
a = 10
b = 10

# С помощью оператора == сравнить две строки и записать значение в compare_strs.
# Распечатать compare_strs и убедиться, что он выводит True
str_1 = "Hello"
str_2 = "Hello"

# С помощью оператора == сравнить два числа и записать значение в compare_ints_2.
# Распечатать compare_ints_2 и убедиться, что он выводит False
a_2 = 20
b_2 = 10

# С помощью оператора == сравнить две строки и записать значение в compare_strs_2.
# Распечатать compare_strs_2 и убедиться, что он выводит False
str_3 = "Hello"
str_4 = "hello"

# С помощью оператора != сравнить два числа и записать значение в compare_ints_3.
# Распечатать compare_ints_3 и убедиться, что он выводит True
a_3 = 20
b_3 = 10

# С помощью оператора > сравнить, что число a_4 больше числа b_4 и записать значение в compare_ints_4.
# Распечатать compare_ints_4 и убедиться, что он выводит True
a_4 = 20
b_4 = 10

# С помощью оператора < сравнить, что число a_5 меньше числа b_5 и записать значение в compare_ints_5.
# Распечатать compare_ints_5 и убедиться, что он выводит False
a_5 = 20
b_5 = 10

# С помощью оператора and вычислить, что число a_6 меньше числа b_6 и a7 больше b7 и записать значение в compare_ints_6.
# Распечатать compare_ints_6 и убедиться, что он выводит True
a_6 = 10
b_6 = 20
a_7 = 30
b_7 = 5

# С помощью оператора or вычислить, что число a_8 меньше числа b_8 или a9 больше b9 и записать значение в compare_ints_8
# Распечатать compare_ints_8 и убедиться, что он выводит True
a_8 = 40
b_8 = 20
a_9 = 30
b_9 = 5
