# #########################################################
# Список - это УПОРЯДОЧЕННАЯ ПОСЛЕДОВАТЕЛЬНОСТЬ ЭЛЕМЕНТОВ
#
# - У каждого из элементов есть свой ИНДЕКС.
# - Индексы начинаются с 0.
# #########################################################


# Создать переменную user_lst и присвоить ей список, который содержит пользователей admin, vadim и maxim.
# Распечатать user_lst и убедиться, что вывелось ['admin', 'vadim', 'maxim'].

# Создать переменную mark_lst, который содержит оценки на экзамене: 9, 8, 8 и 10.
# Распечатать mark_lst.


# Создать переменную student_data, который содержит имя, фамилию и возраст для человека John Doe 35 лет.
# Распечатать student_data.

# Создать переменную empty_lst, который содержит пустой список.
# Распечатать empty_lst.

# Есть 3 переменные microsoft, google и facebook
# Создать переменную company_lst, который содержит 3 переменные microsoft, google и facebook.
# Распечатать company_lst.
microsoft = "Microsoft"
google = "Google"
facebook = "Facebook"


# Создать переменную name_lst и присвоить ей список, который содержит пользователей John, Monica and Mike.
# Посчитать длину списка name_lst и сохранить результат в переменную names_len.
# Распечатать names_len и убедиться, что вывелось 3.


# Создать переменную student_lst, который содержит Andrew, Ted, Ann и Alex.
# Получить первый элемент списка и сохранить его переменную student_name
# Распечатать student_name. Убедиться, что выведется Andrew


# Распечатать имя третьего студента.
# Убедиться, что это будет Ann


# Распечатать имя последнего студента.
# Убедиться, что это будет Alex.


# Распечатать имя третьего с конца студента.
# Убедиться, что это будет Ted.


# Создать переменную phone_lst, который содержит Nokia, IPhone, Samsung и Xiaomi.
# Поменять второй элемент списка, записав туда One Plus
# Распечатать phone_lst. Убедиться, что выведется ['Nokia', 'One Plus', 'Samsung', 'Xiaomi']

# Поменять второй элемент с конца списка, записав туда Sony
# Распечатать phone_lst. Убедиться, что выведется ['Nokia', 'One Plus', 'Sony', 'Xiaomi']


# Создать переменную car_lst, который содержит Honda, Mazda, Zeekr и Audi.
# Удалить второй элемент списка.
# Распечатать car_lst. Убедиться, что выведется ['Honda', 'Zeekr', 'Audi']

# Удалить первый элемент списка.
# Распечатать car_lst. Убедиться, что выведется ['Zeekr', 'Audi']
