# Дана переменная student_name. Преобразовать эту строку в список букв letter_lst.
# Распечатать letter_lst и убедиться, что вывелось ['J', 'o', 'h', 'n'].
student_name = "John"

# Даны два списка машин german_cars and japanese_cars.
# Объединить два списка и сохранить в переменной all_cars
# Распечатать all_cars и убедиться, что вывелось ['Audi', 'BMW', 'Mazda'].
german_cars = ["Audi", "BMW"]
japanese_cars = ["Mazda"]


# Создать список mark_lst со значениями оценок учеников: 7, 9, 8, 10, 5, 6.
# Взять первые два элемента списка и сохранить в переменной first_lst.
# Распечатать first_lst и убедиться, что вывелось [7, 9].


# Взять 3 элемента списка, начиная со второго, и сохранить в переменной second_lst.
# Распечатать second_lst и убедиться, что вывелось [9, 8, 10].


# Взять 4 последних элемента списка, начиная со второго, и сохранить в переменной third_lst.
# Распечатать third_lst и убедиться, что вывелось [8, 10, 5, 6].


