# Объявить (создать) переменную user_name и присвоить ей строковое значение admin


# Создать переменную some_data и присвоить ей целое значение 100
# Затем ей присвоить логическое значение ложь
# Затем ей присвоить строковое значение Hello!


# Объявить (создать) переменную loin и присвоить ей строковое значение test.
# Обратиться к переменной по имени loin и присвоить ее значение другой переменной test_login.
# Распечатать значение переменной test.
# Распечатать значение переменной test_login.

