# Присвоить переменной my_sum результат выражения 10 + 2.
# Распечатать my_sum


# Присвоить переменной my_bool результат выражения 10 > 2.
# Распечатать my_bool


# Присвоить переменной my_str результат выражения Hello + World.
# Распечатать my_str


# Объявить функцию add с двумя числовыми параметрами a и b, которая возвращает сумму a и b.
# Присвоить переменной my_add результат вызова функции add с параметрами 100 и 200.
# Распечатать my_add


# Написать выражение, которое содержит вызов функции print с параметром Hello World!
