# Создать переменную с именем my_str_1 и присвоить ей строку со значением Test через двойные кавычки


# Создать переменную с именем my_str_2 и присвоить ей строку со значением Test через одинарные кавычки


# Создать переменную с именем my_int_1 и присвоить ей целое число 7


# Создать переменную с именем my_bool_1 и присвоить ей логическое значение, которое соответствует истине


# Создать переменную с именем my_bool_2 и присвоить ей логическое значение, которое соответствует лжи


# Создать список с именем my_list_1 с элементами 1, строкой abc и логическим значением истина


# Создать словарь с именем my_dict_1, который будет пустым


# Создать словарь с именем my_dict_2, который будет содержать словарь с одним элементом,
# где ключом будет name, а значением строка John. Используем двойные кавычки
