# Создать переменную salary_amount и присвоить ей значение 99.76.
# Распечатать salary_amount и убедиться, что вывелось 99.76


# Создать переменную price и присвоить ей значение 199.76.
# Преобразовать price в целое число, сохранить в переменную int_price.
# Распечатать int_price и убедиться, что вывелось 199


# Создать переменную price_str и присвоить ей значение 399.76.
# Преобразовать price_str в число с десятичной точкой, сохранить в переменную float_price.
# Распечатать float_price и убедиться, что вывелось 399.76


# Создать переменную weight и присвоить ей значение 499.31.
# Округлить число weight до ближайшего целого и сохранить в переменную rounded_int_weight.
# Распечатать rounded_int_weight и убедиться, что вывелось 499


# Создать переменную height и присвоить ей значение 188.64.
# Округлить число height до ближайшего целого и сохранить в переменную rounded_int_height.
# Распечатать rounded_int_height и убедиться, что вывелось 189




