# Для заданного числа first_num проверить, является ли оно положительным.
# Если положительное, то вывести значение на экран и рядом написать Положительное
# Иначе вывести значение на экран и рядом написать Отрицательное.
first_num = 10

# Для заданного числа first_num проверить, является ли оно положительным.
# Если положительное, то вывести значение на экран и рядом написать Положительное
# Иначе вывести значение на экран и рядом написать Отрицательное.
second_num = -5

# Запросить у пользователя ввести целое число (используй функцию input) и сохранить в переменной data_1_text.
# Преобразовать data_1_text в целое число (используй функцию int) и сохранить в переменной data_1_int.
# Если data_1_int положительное, то вывести значение на экран и рядом написать Положительное
# Иначе вывести значение на экран и рядом написать Отрицательное.


# Напиши программу, которая запрашивает у пользователя его возраст и выводит сообщение о том, является ли он
# совершеннолетним (18 лет и старше) или несовершеннолетним.

