# Создать пустой список user_lst.
# Добавить в список пользователей admin, vadim и maxim.
# Распечатать user_lst и убедиться, что вывелось ['admin', 'vadim', 'maxim'].

# Создать список mark_lst со значениями: 7, 9, 8, 5, 3, 1, 4, 10.
# Удалить последний элемент из списка используя pop.
# Распечатать mark_lst и убедиться, что вывелось [7, 9, 8, 5, 3, 1, 4].


# Удалить первый элемент из списка используя pop.
# Распечатать mark_lst и убедиться, что вывелось [9, 8, 5, 3, 1, 4].

# Удалить первый элемент из списка используя pop и сохранить удаленны элемент в переменной deleted_mark.
# Распечатать deleted_mark и убедиться, что вывелось 9.


# Создать список price_lst со значениями: 1, 9, 8.
# Отсортировать список по возрастанию с помощью методы sort.
# Распечатать price_lst и убедиться, что вывелось [1, 8, 9].

# Отсортировать список по убыванию с помощью методы sort.
# Распечатать price_lst и убедиться, что вывелось [9, 8, 1].

