# Создать переменную user_name и присвоить ей строковое значение admin
# Распечатать значение переменной user_name.


# Создать переменную email_text и присвоить ей строковое значение, как многострочную строку. Ниже текст:
# Мы делили апельсин,
# Много нас, а он один.
# Эта долька — для ежа,
# Эта долька — для стрижа,
# Эта долька — для утят,
# Эта долька — для котят,
# Эта долька — для бобра,
# А для волка — кожура.
# Он сердит на нас. Беда!
# Разбегайтесь кто-куда!
# Распечатать значение переменной email_text.




