# Дано натуральное число. Выведите его последнюю цифру.
#
# Входные данные
# Вводится натуральное число.

# Выходные данные
# Выведите ответ на задачу.

# Примеры
# входные данные
# 179
# выходные данные
# 9

N = input('Enter your number: ')
res = N[-1]
print(res)