# Дано двузначное число. Найдите число десятков в нем.
#
# Входные данные
# Вводится двухзначное число.
#
# Выходные данные
# Выведите ответ на задачу.
#
# Примеры
# входные данные
# 42
# выходные данные
# 4

num = int(input('Enter your number: '))
res = num // 10
print(res)
