# Дан файл file-3.in.txt в каталоге data, который содержит числа, которые нужно сложить
# В первой строке - первое число, а во второй - второе
# Нужно посчитать сумма двух чисел и результат записать в файл file-3.ou.txt

# Подсказки:
# - Используем функцию readline, которая возвращает одну строку из файла file-3.in.txt в каталоге data.
# - так как у нас в файле 2 строки, то нужно вызвать readline дважды.
# - в переменную s1 читаем первую строку файла
# - в num1 заносим число из s1 (используем функцию int)
# - в переменную s2 читаем вторую строку файла
# - в num2 заносим число из s2 (используем функцию int)
# - в переменную res заносим сумму num1 и num2
# - в переменную s заносим res как строку (используем str)
# - записываем s в file-3.out.txt в каталоге tmp

