# - Попросить пользователя ввести ширину прямоугольника и сохранить в переменной ws
# - Преобразовать значение переменной ws в число (использовать функцию int) и сохранить в переменной w
# - Попросить пользователя ввести высоту прямоугольника и сохранить в переменной hs
# - Преобразовать значение переменной hs в число (использовать функцию int) и сохранить в переменной h
# - Посчитать периметр прямоугольника и сохранить переменной res
# - Вывести периметр res на экран

# https://youtu.be/DZvNZ9l9NT4?t=893 - тут можно посмотреть теорию


