# Вот тут можно посмотреть теорию: https://youtu.be/-X2ubBdP2Ak?list=RDCMUCCXF68Da_ndcmvv_9OG75Cw&t=1276

# - Пользователь вводит число с экрана и сохраняем значение в переменную num.
# - Создать список.
# - Используя функцию append добавить в список элементы 0, 1, 2, ..., num -1
# - Вывести список на экран
# Code...

# - Пользователь вводит число с экрана и сохраняем значение в переменную num.
# - Создать список.
# - Используя функцию append добавить в список элементы 0, 1 * 10, 2 * 110, ..., (num -1) * 10
# - Вывести список на экран
# Code...

# - Дан список lst.
# - Создать 2 новых списка lst1 и lst2
# - lst1 содержит числа меньше 10
# - lst2 содержит числа больше 10
# - вывести lst1 и lst2 на экран.
lst = [1, 10, 2, 3, 20, 30]

# - Дан список lst. Сложить первые 3 элемента в списке и добавить результат в lst
# Подсказка:
# - используем переменную total
# - Проходим по первым 3-м элементам lst и складываем в total
# - добавляем total в конец lst
lst = [1, 2, 3, 4, 5]

# - Дан список lst. Сложить первые 3 элемента в списке и добавить результат в lst
# Подсказка:
# - используем переменную total
# - Проходим по первым 3-м элементам lst и складываем в total
# - добавляем total в конец lst
lst = [1, 2, 3, 4, 5]

# - Дан список lst. Заменить первые 3 элемента на их сумму
# Подсказка:
# - После того, как посчитаешь total надо удалить первые 3 элемента
# - Потом вставить (insert) в начало списка значение total (т.е. [6, 4, 5])
lst = [1, 2, 3, 4, 5]
