# - Дан список. Вывести на экран сумму всех элементов списка используя цикл for
# - Подсказка:
# -- использовать переменную total, которая будет храниться сумма
# -- изначально total равна 0
# -- проходя по списку добавлять к total значение элемента списка
total = 0
lst = [1, 2, 3]

# - Дан список. Вывести на экран произведение всех элементов списка используя цикл for
# - Подсказка:
# -- использовать переменную total, которая будет храниться произведение
# -- изначально total равна 1
# -- проходя по списку умножать total на значение элемента списка
total = 1
lst = [1, 2, 3]

# - Дан список. Вывести на экран объединение всех элементов списка ("Hello World !") используя цикл for
# - Подсказка:
# -- использовать переменную s, в которой будем объединать все сроки
# -- изначально total пустая ("")
# -- проходя по списку в total добавляем " " и значение элемента списка
s = ""
lst = ["Hello", "World", "!"]

# - Дан список. Вывести на экран сумму (total) всех элементов списка, которые больше 5
# - Подсказка: использовать if в внутри for
lst = [1, 2, 10, 15, 20]

# - Дан список. Вывести на экран произведение (total) всех элементов списка, которые меньше 5
# - Подсказка: использовать if в внутри for
lst = [1, 2, 10, 15, 20]



