# Задачи на индексы.
# Индекс - это номер элемента в списке. Он начинается от 0 до длина списка - 1

# Дан список. Вывести все индексы списка c помощью for
# Подсказка
# - идем for-ом не по элементам списка, а по индексам. используем range(lent(lst))
lst = [1, 3, 4, 7, 8, 10]

# Найти индекс элемента 7 в списке и распечатать
# Подсказка
# - заводим переменную index и присваиваем -1
# - проходим по всем индексам списка с помощью for-а
# - если элемент равен 7, тогда в переменную index записываем значение текущего индекса и выходим
index = -1
lst = [1, 3, 4, 7, 8, 10]


