# - Дан список. Вывести на экран сумму всех элементов списка используя цикл for
# - Подсказка:
# -- использовать переменную total, которая будет храниться сумма
# -- изначально total равна 0
# -- проходя по списку добавлять к total значение элемента списка
print("=" * 5)
total = 0
lst = [2, 4, 7]
for i in lst:
    total = total + i
print(total)
print("-" * 5)

# - Дан список. Вывести на экран произведение всех элементов списка используя цикл for
# - Подсказка:
# -- использовать переменную total, которая будет храниться произведение
# -- изначально total равна 1
# -- проходя по списку умножать total на значение элемента списка
total = 1
lst = [1, 2, 3]
for i in lst:
    total = total * i
print(total)
print("-" * 5)
# - Дан список. Вывести на экран объединение всех элементов списка ("Hello World !") используя цикл for
# - Подсказка:
# -- использовать переменную s, в которой будем объединать все сроки
# -- изначально total пустая ("")
# -- проходя по списку в total добавляем " " и значение элемента списка
s = ""
lst = ["Hello", "World", "!"]
for i in lst:
    s = s + " " + i
print(s)
# - Дан список. Вывести на экран сумму (total) всех элементов списка, которые больше 5
# - Подсказка: использовать if в внутри for
total = 0
lst = [1, 2, 10, 15, 20]
for i in lst:
    if i > 5:
        total = total + i

print(total)
# - Дан список. Вывести на экран произведение (total) всех элементов списка, которые меньше 5
# - Подсказка: использовать if в внутри for
total = 1
lst = [1, 2, 10, 15, 20]
for i in lst:
    if i < 5:
        total = total * i

print(total)


