# Вывести на экран номер вашего телефон в формате: 365-70-39
# - использовать функцию print c 3 параметрами
# - использовать форматирование

print(str("365-70-39"))

# Максим, результта правильный, но реалтзация не подходит - надо переделать.
# У тебя есть 3 числа: 365, 70 и 39. Их ты передаешь как параметры в функцию print и выводишь в виде: 365-70-39
# Вот запусти видео и там есть Форматы вывода. Посмотри, как тебе вывести 365-70-39
# https://youtu.be/ML5tP8m6SHw?t=190




