# Вывести на экран номер вашего телефон в формате: 365-70-39
# - использовать функцию print c 3 параметрами
# - использовать форматирование

print(str("365-70-39"))

