# Создать сет (множество) s через {} со значениями 1, 2 ,3 и распечатать.
print("= START =")
s = {1, 2, 3}
print(s)
# Создать сет (множество) s через функцию set со значениями 1, 2 ,3 и распечатать.
print("= START =")
s = set([1, 2, 3])
print(s)
# Создать сет (множество) s через {} со значениями 1, 2 ,3, 3 и распечатать.
# Убедиться, что там будет только 3 значения (вторая тройка не добавится)
print("= START =")
s = set([1, 2, 3, 3])
print(s)