# Вот тут можно посмотреть теорию: https://youtu.be/vMD6-jzgDvI?t=431

# - Вывести на экран числа от 1 до 10. Использовать while
# - завести переменную и в ней хранить текущее значение (сначала та будет 1)
# - В в while проверять значение переменной. Если меньше 11, тогда печатать и значение переменнй на 1 увеличить, иначе веходим из цикла
# Код ниже

# - Вывести на экран числа от 21 до 30 с шагом 2 (21, 23, 25, ..., 29).
# - подсказака: задача похода на предыдущую, но нажное переменную увеличить на 2
# Код ниже