# Задача №2961. Упорядочить три числа

# Даны три числа, записанные в отдельных строках. Упорядочите их в порядке неубывания.
#
# Программа должна считывать три числа a, b, c, затем программа должна менять их значения так, чтобы стали выполнены
# условия a <= b <= c, затем программа выводит тройку a, b, c.
#
# Входные данные
# Вводятся три числа, каждое записано в отдельной строке.
#
# Выходные данные
# Выведите ответ на задачу.
#
# Примеры
# входные данные
# 1
# 2
# 1
# выходные данные
# 1 1 2
