# Задача №3066. Среднее значение последовательности
#
# Подсказка: Нужно сделать бесконечный цикл while. И читать ввод данных от пользователя. Если он ввел 0, тогда выходим
# из цикла. Если нет, то берем введенной число и с делаем то, что в задаче прописано.
#
# Определите среднее арифметическое элементов последовательности, завершающейся числом 0.
#
# Число 0 в последовательность не входит. Числа, следующие за нулем, считывать не нужно.
#
# Входные данные
# Вводится последовательность целых чисел. Ввод завершается, когда будет введено число 0.
#
# Выходные данные
# Выведите одно число - среднее арифметическое элементов последовательности
#
# Примеры
# Входные данные
# 1
# 7
# 9
# 0
# Выходные данные
# 5.66666666667
#
