# Создать словарь student с ключами name, phone, born, height
# Вывести на экран словарь student:
print("= START =")
student = {'name': 'Maxim','phone': '+375333657039', 'born': '20.06.08', 'height': 182}
print(student)

# Создать словарь student (изначально без ключей) и создать ключи со значениями (использовать []):
# name - "John"
# phone - "111-22-33"
# born - "20-06-2008"
# height - 186
# Вывести на экран словарь student:
print("= START =")
student = {}
student['name'] = "John"
student['phone'] = "111-22-33"
student['born'] = "20-06-08"
student['height'] = 186
print(student)