# 1. Попросить пользователя ввести имя на экран
# 2. Вывести текст: Ваше имя: и потом то, что ввел пользователь

name = input("Enter your name: ")
print("Your name is ", name)
