# 1. Сложить год, месяц и день своего рождения  res
# 2. Вывести res на экрани сохранить результат в переменную

# код после этого комментария....
day = 20
month = 6
year = 2008
res = day + month + year
print("Result is: ", res)

# Прямоугольник имеет стороны 3 и 4.
# - Посчитать площадь и положить ее в переменную square
# - Вывести res на экран

# код после этого комментария....
L = 4
W = 3
square = L * W
print("Result is: ", square)

# Есть 10 рублей. Сколько разделить из поровну на 4-х человек и вывести результат на экран

# код после этого комментария....

money = 10
person = money / 4
print("Result is: ", person)
