# Напишите команду, которая выведет на экран сообщение «Python work!».
print("Python work!")