# 2 Задачи:
# 1. Вывести Hello World в одну строку на экране
# 2. Вывести Hello в первой строке, а World во второй строке

print("Hello world!")
print("Hello\nworld")
