# 1. Создайте переменную с именем num
# 2. присвойте ей значение 5.
# 3. Выведите значение переменной на экран.

num = 5
print(num)